1password-cli
account-switcher
android-file-transfer
android-platform-tools
appcleaner
balenaetcher
cheatsheet
clashx-pro
discord
font-jetbrains-mono
font-jetbrains-mono-nerd-font
fork
gray
iina
iterm2
keka
kekaexternalhelper
keyboardholder
lulu
mark-text
monitorcontrol
mos
ngrok
notion
paper
picgo
qlcolorcode
qlimagesize
qlmarkdown
qlstephen
qlvideo
quicklook-json
quicklookase
raycast
scroll-reverser
shottr
snipaste
spotify
surge
switchhosts
tabby
telegram
termhere
textmate
vnc-viewer
warp
webpquicklook
yesplaymusic
