tap "1password/tap"
tap "alienator88/cask"
tap "beeftornado/rmtree"
tap "bigwig-club/brew"
tap "buo/cask-upgrade"
tap "charmbracelet/tap"
tap "ecopastehub/ecopaste"
tap "farion1231/ccswitch"
tap "felixkratz/formulae"
tap "github/gh"
tap "he3-app/he3"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "lbjlaq/antigravity-manager", "https://github.com/lbjlaq/Antigravity-Manager"
tap "lihaoyun6/tap"
tap "mac-cleanup/mac-cleanup-py"
tap "mediar-ai/screenpipe", "https://github.com/mediar-ai/screenpipe.git"
tap "mrkai77/cask"
tap "oven-sh/bun"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "sst/tap"
tap "tw93/tap"
tap "ybeapps/sourcegit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Shell extension to jump to frequently used directories
brew "autojump"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Common error values for all GnuPG components
brew "libgpg-error"
# Mac App Store command-line interface
brew "mas"
# Open source visual route tracking CLI tool
brew "nexttrace"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Install NodeJS versions
brew "node-build"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Fast, disk space efficient package manager
brew "pnpm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Display and control your Android device
brew "scrcpy"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# Python cleanup script for macOS
brew "mac-cleanup/mac-cleanup-py/mac-cleanup-py"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
cask "bigwig-club/brew/account-switcher"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Professional Account Management for AI Services
cask "lbjlaq/antigravity-manager/antigravity-tools"
# Platform for API documentation, debugging, Mock and testing
cask "apipost"
# Application uninstaller
cask "appcleaner"
# User-friendly GUI app for Homebrew
cask "applite"
# Chromium based browser
cask "arc"
# Alternative GUI for Time Machine
cask "backuploupe"
# Menu bar icon organiser
cask "bartender"
# Configuration manager for Claude Code, Codex, Gemini and OpenCode
cask "farion1231/ccswitch/cc-switch"
# Rule-based custom proxy with GUI based on clash
cask "clashx-pro"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Claude code parallelisation
cask "conductor"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-cascadia-mono"
cask "font-departure-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-source-code-pro"
cask "font-victor-mono-nerd-font"
# GIT client
cask "fork"
# Git client for simultaneous branches on top of your existing workflow
cask "gitbutler"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome@beta"
# Tool to set light or dark appearance on a per-app basis
cask "gray"
# Terminal built on web technologies
cask "hyper"
# Free and open-source media player
cask "iina"
# Tool for multi-language users
cask "input-source-pro"
# Menu bar manager
cask "jordanbaird-ice"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Open-source keystroke visualiser
cask "keycastr"
# Utility that shows the latest app updates
cask "latest"
# Launchpad alternative
cask "launchos"
# Change the style of the Apple logo in macOS menu bar.
cask "lihaoyun6/tap/logoer"
# Window manager
cask "loop"
# Track and update to the latest versions of installed software
cask "macupdater"
# Access the menu from anywhere
cask "menuwhere"
# Remote desktop client
cask "microsoft-remote-desktop"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# GameStream client
cask "moonlight"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Music streaming platform
cask "neteasemusic"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# System and utility switches
cask "only-switch"
# AI coding agent desktop client
cask "opencode-desktop"
# Replacement for Docker Desktop
cask "orbstack"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Chinese music streaming application
cask "qqmusic"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Quick Look generator for Adobe Swatch Exchange files
cask "quicklookase"
# A lightweight and high-performance screen recorder for macOS.
cask "lihaoyun6/tap/quickrecorder"
# Control your tools with a few keystrokes
cask "raycast"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
# Snip or pin screenshots
cask "snipaste"
# System monitor for the menu bar
cask "stats"
# App to switch hosts
cask "switchhosts"
# Terminal emulator, SSH and serial client
cask "tabby"
# Messaging app with a focus on speed and security
cask "telegram"
# Finder extension for opening a terminal from the current directory
cask "termhere"
# Remote control software
cask "todesk"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Rust-based terminal
cask "warp"
# Quick Look plugin for webp files
cask "webpquicklook"
# Free messaging and calling application
cask "wechat"
# Wine wrapper built with SwiftUI
cask "whisky"
# Network protocol analyzer
cask "wireshark-app"
# All-in-one office service platform in Chinese
cask "wpsoffice-cn"
mas "1Capture", id: 6742318274
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "AmorphousDiskMark", id: 1168254295
mas "Barbee", id: 1548711022
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Bob", id: 1630034110
mas "Command X", id: 6448461551
mas "Data Jar", id: 1453273600
mas "DockX", id: 6452276577
mas "Dropover", id: 1355679052
mas "Encrypto", id: 935235287
mas "Folder Preview", id: 6698876601
mas "HEIC Converter", id: 1294126402
mas "Infuse", id: 1136220934
mas "Longshot", id: 6450262949
mas "MenubarX", id: 1575588022
mas "Microsoft To Do", id: 1274495053
mas "NeoMan", id: 6448362669
mas "PasteNow", id: 1552536109
mas "PushDeer", id: 1596771139
mas "QQ", id: 451108668
mas "Spark Desktop", id: 6445813049
mas "Speedtest", id: 1153157709
mas "TestFlight", id: 899247664
mas "uPic", id: 1341586328
mas "Velja", id: 1607635845
mas "VidHub", id: 1659622164
mas "Windows App", id: 1295203466
mas "Xnip", id: 1221250572
mas "小米互联服务", id: 6673908449
mas "沉浸式翻译", id: 6447957425
