tap "1password/tap"
tap "alienator88/cask"
tap "beeftornado/rmtree"
tap "bigwig-club/brew"
tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "ecopastehub/ecopaste"
tap "felixkratz/formulae"
tap "github/gh"
tap "he3-app/he3"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "lihaoyun6/tap"
tap "mac-cleanup/mac-cleanup-py"
tap "mediar-ai/screenpipe", "https://github.com/mediar-ai/screenpipe.git"
tap "mrkai77/cask"
tap "oven-sh/bun"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "th-ch/youtube-music"
tap "ybeapps/sourcegit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Shell extension to jump to frequently used directories
brew "autojump"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Open source visual route tracking CLI tool
brew "nexttrace"
# Development kit for the Java programming language
brew "openjdk"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Safe, concurrent, practical language
brew "rust"
# Display and control your Android device
brew "scrcpy"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Cloudflare Warp
brew "cloudflare/cloudflare/warp", link: false
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Python cleanup script for macOS
brew "mac-cleanup/mac-cleanup-py/mac-cleanup-py"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
cask "account-switcher"
# Enable Windows-like alt-tab
cask "alt-tab"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Platform for API documentation, debugging, Mock and testing
cask "apipost"
# Application uninstaller
cask "appcleaner"
# User-friendly GUI app for Homebrew
cask "applite"
# Chromium based browser
cask "arc"
# Alternative GUI for Time Machine
cask "backuploupe"
# Menu bar icon organiser
cask "bartender"
# iOS device backup software
cask "bbackupp"
# Rule-based custom proxy with GUI based on clash
cask "clashx-pro"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Dictionary and translator app
cask "easydict"
# Web browser
cask "firefox"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
# SFMono with Nerd Font Glyphs and Fira Code Ligatures
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-source-code-pro"
cask "font-victor-mono-nerd-font"
# GIT client
cask "fork"
# Git client for simultaneous branches on top of your existing workflow
cask "gitbutler"
# Web browser
cask "google-chrome"
# Tool to set light or dark appearance on a per-app basis
cask "gray"
# A Free, Modern Toolbox Built for Developers.
cask "he3"
# Terminal built on web technologies
cask "hyper"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Switch input method per application
cask "keyboardholder"
# Open-source keystroke visualiser
cask "keycastr"
# Utility that shows the latest app updates
cask "latest"
# Software for Logitech devices
cask "logi-options+"
# Change the style of the Apple logo in macOS menu bar.
cask "logoer"
# Window manager
cask "loop"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Track and update to the latest versions of installed software
cask "macupdater"
# Access the menu from anywhere
cask "menuwhere"
# Remote desktop client
cask "microsoft-remote-desktop"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# GameStream client
cask "moonlight"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Open-source download manager
cask "motrix"
# Music streaming platform
cask "neteasemusic"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# System and utility switches
cask "only-switch"
# Replacement for Docker Desktop
cask "orbstack"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Tool for uploading images
cask "picgo"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Chinese music streaming application
cask "qqmusic"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Quick Look generator for Adobe Swatch Exchange files
cask "quicklookase"
# A lightweight and high-performance screen recorder for macOS.
cask "quickrecorder"
# Control your tools with a few keystrokes
cask "raycast"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
# Snip or pin screenshots
cask "snipaste"
# Open-source Git GUI client
cask "sourcegit"
# Open source cross-platform file explorer
cask "spacedrive"
# System monitor for the menu bar
cask "stats"
# Network toolbox
cask "surge"
# App to switch hosts
cask "switchhosts"
# Terminal emulator, SSH and serial client
cask "tabby"
# Messaging app with a focus on speed and security
cask "telegram"
# Finder extension for opening a terminal from the current directory
cask "termhere"
# Remote control software
cask "todesk"
# Pin any window to the top of your screen.
cask "topit"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Quick Look plugin for webp files
cask "webpquicklook"
# Free messaging and calling application
cask "wechat"
# Wine wrapper built with SwiftUI
cask "whisky"
# Third-party NetEase cloud player
cask "yesplaymusic"
# YouTube Music Desktop App
cask "youtube-music"
# Multiplayer code editor
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "AmorphousDiskMark", id: 1168254295
mas "Bob", id: 1630034110
mas "ChatX", id: 6446304087
mas "Command X", id: 6448461551
mas "Data Jar", id: 1453273600
mas "Disk Speed Test", id: 425264550
mas "DockX", id: 6452276577
mas "Draw Things", id: 6444050820
mas "Dropover", id: 1355679052
mas "Encrypto", id: 935235287
mas "HEIC Converter", id: 1294126402
mas "Immersive Translate", id: 6447957425
mas "Infuse", id: 1136220934
mas "Keynote 讲演", id: 409183694
mas "Longshot", id: 6450262949
mas "MenubarX", id: 1575588022
mas "Microsoft To Do", id: 1274495053
mas "NeoServer", id: 6448362669
mas "One Thing", id: 1604176982
mas "OpenCat", id: 6445999201
mas "Pages 文稿", id: 409201541
mas "PasteNow", id: 1552536109
mas "Picview", id: 6452016140
mas "PushDeer", id: 1596771139
mas "QQ", id: 451108668
mas "sing-box", id: 6451272673
mas "Spark Desktop", id: 6445813049
mas "Speedtest", id: 1153157709
mas "Termius", id: 1176074088
mas "TestFlight", id: 899247664
mas "Today", id: 6443714928
mas "uPic", id: 1341586328
mas "Velja", id: 1607635845
mas "VidHub", id: 1659622164
mas "Windows App", id: 1295203466
mas "Xnip", id: 1221250572
mas "企业微信", id: 1189898970
mas "网易爆米花", id: 6553989480
mas "钉钉", id: 1435447041
