tap "1password/tap"
tap "bigwig-club/brew"
tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "felixkratz/formulae"
tap "github/gh"
tap "he3-app/he3"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "lihaoyun6/tap"
tap "mrkai77/cask"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Shell extension to jump to frequently used directories
brew "autojump"
# Cross-platform make
brew "cmake"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Duplicate file utility
brew "czkawka"
# Pack, ship and run any application as a lightweight container
brew "docker"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Fast and simple Node.js version manager
brew "fnm"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Fast, disk space efficient package manager
brew "pnpm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Safe, concurrent, practical language
brew "rust"
# Display and control your Android device
brew "scrcpy"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Cloudflare Warp
brew "cloudflare/cloudflare/warp", link: false
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Password manager that keeps all passwords secure behind one password
cask "1password"
cask "account-switcher"
# Apple TV Aerial screensaver
cask "aerial"
# Enable Windows-like alt-tab
cask "alt-tab"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Platform for API documentation, debugging, Mock and testing
cask "apipost"
# Application uninstaller
cask "appcleaner"
# Control the window brightness of a specific App.
cask "appdimmer"
# Chromium based browser
cask "arc"
# Alternative GUI for Time Machine
cask "backuploupe"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organiser
cask "bartender"
# Rule-based custom proxy with GUI based on clash
cask "clashx-pro"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Dictionary and translator app
cask "easydict"
# Status monitoring
cask "eul"
# Web browser
cask "firefox"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
# SFMono with Nerd Font Glyphs and Fira Code Ligatures
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-source-code-pro"
cask "font-victor-mono-nerd-font"
# GIT client
cask "fork"
# Git client for simultaneous branches on top of your existing workflow
cask "gitbutler"
# Web browser
cask "google-chrome"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Tool to set light or dark appearance on a per-app basis
cask "gray"
# A Free, Modern Toolbox Built for Developers.
cask "he3"
# Terminal built on web technologies
cask "hyper"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Switch input method per application
cask "keyboardholder"
# Software for Logitech devices
cask "logi-options-plus"
# Window manager
cask "loop"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Track and update to the latest versions of installed software
cask "macupdater"
# Remote desktop client
cask "microsoft-remote-desktop"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# GameStream client
cask "moonlight"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Open-source download manager
cask "motrix"
# Music streaming platform
cask "neteasemusic"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# System and utility switches
cask "only-switch"
# Replacement for Docker Desktop
cask "orbstack"
# Remote desktop
cask "parsec"
# Tool for uploading images
cask "picgo"
# Sideload iOS apps and games
cask "playcover-community"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Chinese music streaming application
cask "qqmusic"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Quick Look generator for Adobe Swatch Exchange files
cask "quicklookase"
# A lightweight and high-performance screen recorder for macOS.
cask "quickrecorder"
# Control your tools with a few keystrokes
cask "raycast"
# Snip or pin screenshots
cask "snipaste"
# Open source cross-platform file explorer
cask "spacedrive"
# Tool for managing the OpenSSH ssh client configuration file
cask "ssh-config-editor"
# System monitor for the menu bar
cask "stats"
# Network toolbox
cask "surge"
# App to switch hosts
cask "switchhosts"
# Terminal emulator, SSH and serial client
cask "tabby"
# Messaging app with a focus on speed and security
cask "telegram"
# Finder extension for opening a terminal from the current directory
cask "termhere"
# Remote control software
cask "todesk"
# Utility to hide the notch
cask "topnotch"
# Virtual machines UI using QEMU
cask "utm"
# Plug-in productivity tool set
cask "utools"
# Open-source code editor
cask "visual-studio-code"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Rust-based terminal
cask "warp"
# Quick Look plugin for webp files
cask "webpquicklook"
# Free messaging and calling application
cask "wechat"
# Wine wrapper built with SwiftUI
cask "whisky"
# All-in-one office service platform in Chinese
cask "wpsoffice-cn"
# Third-party NetEase cloud player
cask "yesplaymusic"
# Multiplayer code editor
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "AmorphousDiskMark", id: 1168254295
mas "Barbee", id: 1548711022
mas "Bob", id: 1630034110
mas "ChatX", id: 6446304087
mas "Command X", id: 6448461551
mas "Data Jar", id: 1453273600
mas "Day Progress", id: 6450280202
mas "Disk Speed Test", id: 425264550
mas "DockX", id: 6452276577
mas "Draw Things", id: 6444050820
mas "Dropover", id: 1355679052
mas "Folder Hub", id: 6473019059
mas "Folder Peek", id: 1615988943
mas "HEIC Converter", id: 1294126402
mas "iCopy", id: 1638023723
mas "iMovie 剪辑", id: 408981434
mas "Infuse", id: 1136220934
mas "Keynote 讲演", id: 409183694
mas "LocalSend", id: 1661733229
mas "Longshot", id: 6450262949
mas "MagicNotch", id: 6447055708
mas "Magnet", id: 441258766
mas "Menu Bar Calendar", id: 1558360383
mas "MenubarX", id: 1575588022
mas "Microsoft To Do", id: 1274495053
mas "NeoServer", id: 6448362669
mas "Numbers 表格", id: 409203825
mas "Omi录屏专家", id: 1592987853
mas "Omnivore", id: 1564031042
mas "One Thing", id: 1604176982
mas "OpenCat", id: 6445999201
mas "Pages 文稿", id: 409201541
mas "PasteNow", id: 1552536109
mas "Picview", id: 6452016140
mas "Plash", id: 1494023538
mas "PushDeer", id: 1596771139
mas "QQ", id: 451108668
mas "ScreenBrush", id: 1233965871
mas "ServerCat", id: 1501532023
mas "Silicon Info", id: 1542271266
mas "sing-box", id: 6451272673
mas "Spark Desktop", id: 6445813049
mas "Speedtest", id: 1153157709
mas "Store Redirect", id: 1601434613
mas "TestFlight", id: 899247664
mas "Thor Launcher", id: 1120999687
mas "Today", id: 6443714928
mas "uPic", id: 1341586328
mas "Velja", id: 1607635845
mas "VidHub", id: 1659622164
mas "效率控", id: 1435159279
mas "滴答清单", id: 966085870
mas "百度网盘", id: 547166701
mas "谜底时钟", id: 1536358464
mas "超级右键 Lite", id: 1552554632
mas "钉钉", id: 1435447041
mas "飞书", id: 1551632588
mas "高德地图", id: 461703208
