tap "1password/tap"
tap "gouravkhunger/guiscrcpy"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Fast and simple Node.js version manager
brew "fnm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Display and control your Android device
brew "scrcpy"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Internet file retriever
brew "wget"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Apple TV Aerial screensaver
cask "aerial"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Lock/unlock Apple computers using the proximity of a bluetooth low energy device
cask "bleunlock"
# Rule-based custom proxy with GUI based on clash
cask "clashx-pro"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Typeface made for developers
cask "font-jetbrains-mono"
# GIT client
cask "fork"
# Tool to set light or dark appearance on a per-app basis
cask "gray"
# Free and open-source media player
cask "iina"
# File archiver
cask "keka"
# Switch input method per application
cask "keyboardholder"
# Simple and elegant markdown editor
cask "mark-text"
# Remote desktop client
cask "microsoft-remote-desktop"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Remote desktop
cask "parsec"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# QuickLook generator for video files
cask "qlvideo"
# QuickLook plugin for JSON files
cask "quicklook-json"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# App to switch hosts
cask "switchhosts"
# Terminal emulator, SSH and serial client
cask "tabby"
# Remote control software
cask "todesk"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Rust-based terminal
cask "warp"
cask "webpquicklook"
# Third-party NetEase cloud player
cask "yesplaymusic"
mas "Bob", id: 1630034110
mas "Dropover", id: 1355679052
mas "Infuse", id: 1136220934
mas "Magnet", id: 441258766
mas "Microsoft To Do", id: 1274495053
mas "Numbers 表格", id: 409203825
mas "Omi录屏专家", id: 1592987853
mas "PasteNow", id: 1552536109
mas "PushDeer", id: 1596771139
mas "RunCat", id: 1429033973
mas "ServerCat", id: 1501532023
mas "Speedtest", id: 1153157709
mas "Telegram", id: 747648890
mas "Termius", id: 1176074088
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
