tap "1password/tap"
tap "gouravkhunger/guiscrcpy"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Framework for layout and rendering of i18n text
brew "pango"
# Fast and simple Node.js version manager
brew "fnm"
# Git extension for versioning large files
brew "git-lfs"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Parallel bzip2 utility
brew "lbzip2"
# Mac App Store command-line interface
brew "mas"
# Display and control your Android device
brew "scrcpy"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Generate WireGuard profile from Cloudflare Warp account
brew "wgcf"
# Internet file retriever
brew "wget"
# Command-line interface for 1Password
cask "1password-cli"
# Apple TV Aerial screensaver
cask "aerial"
# Enable Windows-like alt-tab
cask "alt-tab"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Lock/unlock Apple computers using the proximity of a bluetooth low energy device
cask "bleunlock"
# Rule-based custom proxy with GUI based on clash
cask "clashx-pro"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Typeface made for developers
cask "font-jetbrains-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
cask "font-space-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-space-mono-nerd-font"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Tool to set light or dark appearance on a per-app basis
cask "gray"
# Free and open-source media player
cask "iina"
# File archiver
cask "keka"
# Switch input method per application
cask "keyboardholder"
# Markdown editor
cask "mark-text"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge-beta"
# Remote desktop client
cask "microsoft-remote-desktop"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Remote desktop
cask "parsec"
# HTTP client that helps testing and describing APIs
cask "paw"
# Timer application
cask "pomotroid"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Chinese music streaming application
cask "qqmusic"
# QuickLook plugin for JSON files
cask "quicklook-json"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# App to switch hosts
cask "switchhosts"
# Terminal emulator, SSH and serial client
cask "tabby"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin8"
# Remote control software
cask "todesk"
# Rust-based terminal
cask "warp"
# QuickLook plugin for webp files
cask "webpquicklook"
# Multiplayer code editor
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Bob", id: 1630034110
mas "DockX", id: 6452276577
mas "Dropover", id: 1355679052
mas "Flow", id: 1423210932
mas "Magnet", id: 441258766
mas "MenubarX", id: 1575588022
mas "Microsoft To Do", id: 1274495053
mas "Numbers 表格", id: 409203825
mas "Omi录屏专家", id: 1592987853
mas "OpenCat", id: 6445999201
mas "PasteNow", id: 1552536109
mas "PushDeer", id: 1596771139
mas "RunCat", id: 1429033973
mas "ServerCat", id: 1501532023
mas "Silicon Info", id: 1542271266
mas "Speedtest", id: 1153157709
mas "Telegram", id: 747648890
mas "Termius", id: 1176074088
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
