tap "1password/tap"
tap "gouravkhunger/guiscrcpy"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Framework for layout and rendering of i18n text
brew "pango"
# Fast and simple Node.js version manager
brew "fnm"
# Git extension for versioning large files
brew "git-lfs"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Parallel bzip2 utility
brew "lbzip2"
# Mac App Store command-line interface
brew "mas"
# Display and control your Android device
brew "scrcpy"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Generate WireGuard profile from Cloudflare Warp account
brew "wgcf"
# Internet file retriever
brew "wget"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Apple TV Aerial screensaver
cask "aerial"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Lock/unlock Apple computers using the proximity of a bluetooth low energy device
cask "bleunlock"
# Rule-based custom proxy with GUI based on clash
cask "clashx-pro"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Typeface made for developers
cask "font-jetbrains-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Tool to set light or dark appearance on a per-app basis
cask "gray"
# Free and open-source media player
cask "iina"
# File archiver
cask "keka"
# Switch input method per application
cask "keyboardholder"
# Markdown editor
cask "mark-text"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge-beta"
# Remote desktop client
cask "microsoft-remote-desktop"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Music streaming platform
cask "neteasemusic"
# App to write, plan, collaborate, and get organized
cask "notion"
# Remote desktop
cask "parsec"
# HTTP client that helps testing and describing APIs
cask "paw"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# QuickLook plugin for JSON files
cask "quicklook-json"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# App to switch hosts
cask "switchhosts"
# Terminal emulator, SSH and serial client
cask "tabby"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin8"
# Remote control software
cask "todesk"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Rust-based terminal
cask "warp"
cask "webpquicklook"
mas "1Password for Safari", id: 1569813296
mas "Bob", id: 1630034110
mas "Dropover", id: 1355679052
mas "Infuse", id: 1136220934
mas "Magnet", id: 441258766
mas "Microsoft To Do", id: 1274495053
mas "Numbers 表格", id: 409203825
mas "Omi录屏专家", id: 1592987853
mas "OpenCat", id: 6445999201
mas "PasteNow", id: 1552536109
mas "PushDeer", id: 1596771139
mas "RunCat", id: 1429033973
mas "ServerCat", id: 1501532023
mas "Speedtest", id: 1153157709
mas "Telegram", id: 747648890
mas "Termius", id: 1176074088
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
vscode "1Password.op-vscode"
vscode "aaron-bond.better-comments"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "alipay.minicode"
vscode "ant-codespaces.vscode-marketplace"
vscode "ant-codespaces.vscode-remote"
vscode "azemoh.one-monokai"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "csstools.postcss"
vscode "DanielSanMedium.dscodegpt"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "ElAnandKumar.el-vsc-product-icon-theme"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "enkia.tokyo-night"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "Google.aidl-language"
vscode "Gruntfuggly.todo-tree"
vscode "ionutvmi.path-autocomplete"
vscode "jebbs.plantuml"
vscode "johnpapa.vscode-peacock"
vscode "kamikillerto.vscode-colorize"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lancewilhelm.horizon-extended"
vscode "LeetCode.vscode-leetcode"
vscode "MariusAlchimavicius.json-to-ts"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.min-theme"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "MS-CEINTL.vscode-language-pack-zh-hans"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vscode.vscode-typescript-tslint-plugin"
vscode "ms-vsliveshare.vsliveshare"
vscode "mutantdino.resourcemonitor"
vscode "natessilva.ts-prop-dag"
vscode "OBKoro1.korofileheader"
vscode "octref.vetur"
vscode "PeterSchmalfeldt.explorer-exclude"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "radiolevity.search-lights"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ronnidc.nunjucks"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shardulm94.trailing-spaces"
vscode "SimonSiefke.svg-preview"
vscode "softwaredotcom.swdc-vscode"
vscode "svelte.svelte-vscode"
vscode "TabNine.tabnine-vscode"
vscode "tinkertrain.theme-panda"
vscode "vincaslt.highlight-matching-tag"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "Vue.volar"
vscode "WallabyJs.console-ninja"
vscode "WallabyJs.quokka-vscode"
vscode "wesbos.theme-cobalt2"
vscode "wmaurer.vscode-jumpy"
vscode "xabikos.JavaScriptSnippets"
vscode "yoyo930021.vuter"
vscode "zhuangtongfa.material-theme"
