tap "1password/tap"
tap "bigwig-club/brew"
tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "felixkratz/formulae"
tap "github/gh"
tap "he3-app/he3"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "lihaoyun6/tap"
tap "mrkai77/cask"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
# Shell extension to jump to frequently used directories
brew "autojump"
# Cross-platform make
brew "cmake"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Fast and simple Node.js version manager
brew "fnm"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Fast, disk space efficient package manager
brew "pnpm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Safe, concurrent, practical language
brew "rust"
# Display and control your Android device
brew "scrcpy"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
cask "account-switcher"
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "AmorphousDiskMark", id: 1168254295
mas "Bob", id: 1630034110
mas "ChatX", id: 6446304087
mas "Command X", id: 6448461551
mas "Data Jar", id: 1453273600
mas "Day Progress", id: 6450280202
mas "Disk Speed Test", id: 425264550
mas "DockX", id: 6452276577
mas "Dropover", id: 1355679052
mas "HEIC Converter", id: 1294126402
mas "iCopy", id: 1638023723
mas "Infuse", id: 1136220934
mas "Keynote 讲演", id: 409183694
mas "Menu Bar Calendar", id: 1558360383
mas "MenubarX", id: 1575588022
mas "Microsoft To Do", id: 1274495053
mas "NeoServer", id: 6448362669
mas "Omi录屏专家", id: 1592987853
mas "One Thing", id: 1604176982
mas "OpenCat", id: 6445999201
mas "PasteNow", id: 1552536109
mas "PushDeer", id: 1596771139
mas "QQ", id: 451108668
mas "ServerCat", id: 1501532023
mas "Silicon Info", id: 1542271266
mas "sing-box", id: 6451272673
mas "Spark Desktop", id: 6445813049
mas "Speedtest", id: 1153157709
mas "TestFlight", id: 899247664
mas "Thor Launcher", id: 1120999687
mas "Today", id: 6443714928
mas "Velja", id: 1607635845
mas "VidHub", id: 1659622164
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
mas "滴答清单", id: 966085870
mas "百度网盘", id: 547166701
mas "谜底时钟", id: 1536358464
mas "钉钉", id: 1435447041
mas "飞书", id: 1551632588
mas "高德地图", id: 461703208
